#include <stdio.h>
// 宏定义 :名称,值(字面量,字符串)
#define PI 3.14159265358
#define DIV 32.0
#define FACTOR (5.F / 9)

/// @brief op.c
/// @return
/**
 * 上节课:
 * 标识符
 * 函数组成:函数名,函数体,参数列表,返回值
 * 声明(空间分配) 赋值 初始化
 * a = 9; 9是字面量
 * a = 1+2; 1+2是表达式  3
 * a = a-1; a-1 赋值给a
 * a = max(3,2) 函数
 */
int main()
{
    //  printf("       *\n");
    //     printf("      *\n");
    //     printf("     *\n");
    //     printf("*   *\n");
    //     printf(" * *\n");
    //     printf("  *\n");
    //     printf("        *\n       *\n      *\n     *\n*   *\n * *\n  *\n");

    // int x;
    // x=2;
    // printf("%d\n",x);

    // int a=2/3; // 0000000000000000... 32
    // float b=2.f/3;//0.00000000 00000000000 ...23
    // 模运算:整数 ,不能是浮点数
    //  printf("%d\n",7/4);//1
    // printf("%d\n",7%4);//0~3 */
    // /printf(%d\n,7.2f%4); 不能是浮点数
    // a=a+3;
    // a+=3;//复合赋值
    // //计数器
    // a++;

    //------------------------------------------------------------- 输入
    // print,scan,get,getc,gets
    // 提示用户输入华氏度,输出摄氏度
    // c=(f-32)*5/9
    // 格式化读取
    //%d,%f,%o &取地址符 获得所对应的内存地址

    // printf("请输入华氏度:");
    // double c, f;
    // scanf("%lf", &f);
    // c = (f - DIV) * FACTOR;
    // printf("华氏度:%5.1f \n摄氏度:%5.1lf\n",f, c);
    //将一个整数分解成多位 用模10除10  n%10 
    int x,y,z; char c; 


    return 0;
}
