#include <stdio.h>

int main(int argc, char const *argv[])
{
    

    //------------------------------------------------------------------------
    // int a = 3;
    // int *p = NULL; // 初始化为空指针 也不可解引用 确定的 已知行为  野指针是未知行为
    // // *p = 10;
    // printf(" %p\n", p);
    // p = &a;
    // if (p != NULL) // 判断非空
    // {
    //     printf("%d", *p);
    // }
    //------------------------------------------------------------------------
    // 指针与数组
    // 数组: 复合/组合数据类型
    // char ch[6] = {'a', 'b', 'c', 'd', 'e'};
    int ch[6] = {1, 2, 3, 4, 5};

    // int *p = NULL;
    int *p = ch; // 数组名表示数组的首地址 通常情况下使用  ;以下均可赋值
             // *p= &ch[0]; // 数组第一个元素的地址
             // *p= &ch; // 数组的地址

    while (p < ch + 5)
    {
        printf("%d ", *p++);
    }
    
    // for (int i = 0; i < 6; i++)
    // {
    //     printf("%d %d %p\n", i, ch[i], &ch[i]);
    // }
    // printf("\n %p %p %p\n", ch, &ch, &ch[0]);

    return 0;
}
