#include <stdio.h>
int main()
{

    // //字符串 ""括住的文本内容是元素加一
    // char ch[]="中";
    // printf("%s\n",ch);
    
    

    



    // ---------------------------------------------------------------------
    // char ch = 'a';
    // printf("请输入一个字符：");
    // // scanf("%c", &ch);
    // ch=getchar(); //读取一个字符
    // if (ch >= '0' && ch <= '9')
    // {
    //     puts("您输入的是一个数字字符\n");
    // }
    // if ((ch >= 'A' && ch <= 'Z')
    //      || (ch >= 'a' && ch <= 'z'))  //正则表达式(模式匹配)
    // {
    //     puts("您输入的是一个字母字符\n");
    // }

    // ---------------------------------------------------------------------
    // for (int i = 0; i < 128; i++)
    // {
    //     printf("'%c'(%3d)\t",i, i);
    //     if (i%8==7)
    //     {
    //         printf("\n");
    //     }

    // }
    // ---------------------------------------------------------------------
    // char ch ='1' ;
    // char ch2 =1  ;

    // printf("%d '%c'\n",ch, ch);
    // printf("%d '%c'\n",ch2, ch2);
    // return 0;
}